{
  "games": [
    {
      "id": "1",
      "name": "Grand Thief Auto V (GTA 5)",
      "tags": [
        "role-playing",
        "action"
      ],
      "details": {
        "publisher": "Rockstar Games",
        "published_date": {
          "$date": "2013-09-17T00:00:00Z"
        },
        "describe": "Grand Theft Auto V (GTA V) là một trong những tựa game hành động nhập vai thế giới mở nổi tiếng nhất từ Rockstar Games. Lấy bối cảnh tại thành phố hư cấu Los Santos, dựa trên Los Angeles, và các vùng nông thôn lân cận của bang San Andreas, trò chơi đưa người chơi vào năm 2013, giữa thời kỳ khủng hoảng kinh tế và sự bùng nổ công nghệ. GTA V xoay quanh ba nhân vật chính: Michael De Santa, một tên cướp ngân hàng đã nghỉ hưu; Franklin Clinton, một tay lái xe đường phố đầy tham vọng; và Trevor Philips, một kẻ tâm thần với quá khứ tội phạm. Người chơi có thể tự do chuyển đổi giữa ba nhân vật này để trải nghiệm các góc nhìn khác nhau trong cốt truyện phức tạp, đầy drama về tội phạm, lòng trung thành và sự phản bội. Lối chơi của GTA V kết hợp giữa các nhiệm vụ kịch tính như cướp ngân hàng, đua xe, bắn súng, và khám phá thế giới mở rộng lớn với vô số hoạt động phụ như chơi golf, lặn biển, săn bắn, hoặc tham gia thị trường chứng khoán trong game. Chế độ GTA Online mở rộng trải nghiệm với thế giới đa người chơi, nơi người chơi có thể hợp tác hoặc cạnh tranh trong các nhiệm vụ, sự kiện, và xây dựng đế chế tội phạm của riêng mình. Với đồ họa ấn tượng, cốt truyện sâu sắc, và tự do gần như không giới hạn, GTA V đã trở thành biểu tượng của dòng game thế giới mở.",
        "age-limit": "13+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937138/gta_1_rvvqgq.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937138/gta_4_jwpvou.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937138/gta_2_isdbwa.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937139/gta_3_fhbwai.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937138/gta_5_yfhp66.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1745937524/gta_thumb_hjpu9p.jpg",
      "minimum_configuration": {
        "os": "Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1, Windows Vista 64 Bit Service Pack 2* (*NVIDIA video card nếu chạy hệ Vista).",
        "cpu": "Intel Core 2 Quad CPU Q6600 @ 2.40GHz (4 CPUs) / AMD Phenom 9850 Quad-Core Processor (4 CPUs) @ 2.5GHz.",
        "ram": "4 GB.",
        "gpu": "NVIDIA 9800 GT 1GB / AMD HD 4870 1GB (DX 10, 10.1, 11).",
        "disk": "65 GB."
      },
      "recommended_configuration": {
        "os": "Windows 8.1 64 Bit, Windows 8 64 Bit, Windows 7 64 Bit Service Pack 1.",
        "cpu": "Intel Core i5 3470 @ 3.2GHz (4 CPUs) / AMD X8 FX-8350 @ 4GHz (8 CPUs).",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 660 2GB / AMD HD 7870 2GB.",
        "disk": "65 GB."
      },
      "price": 259000
    },
    {
      "id": "2",
      "name": "The Witcher 3: Wild Hunt",
      "tags": [
        "role-playing",
        "action",
        "adventure"
      ],
      "details": {
        "publisher": "CD Projekt Red",
        "published_date": {
          "$date": "2015-05-19T00:00:00Z"
        },
        "describe": "The Witcher 3: Wild Hunt là đỉnh cao của dòng game nhập vai hành động thế giới mở, được phát triển bởi CD Projekt Red. Người chơi hóa thân thành Geralt of Rivia, một thợ săn quái vật chuyên nghiệp (Witcher), trong hành trình tìm kiếm Ciri, cô con gái nuôi có sức mạnh đặc biệt, giữa bối cảnh thế giới giả tưởng đậm chất Trung Âu đang bị tàn phá bởi chiến tranh và các thế lực siêu nhiên. Trò chơi diễn ra trên một bản đồ rộng lớn bao gồm các vùng đất như Velen hoang tàn, quần đảo Skellige đầy gió, và thành phố Novigrad nhộn nhịp. Lối chơi của The Witcher 3 kết hợp chiến đấu thời gian thực với kiếm thuật, phép thuật, và các kỹ năng Witcher độc đáo, cùng với hệ thống lựa chọn cốt truyện phân nhánh, nơi mỗi quyết định của người chơi có thể thay đổi số phận của nhân vật và thế giới. Ngoài các nhiệm vụ chính, game cung cấp hàng trăm nhiệm vụ phụ được xây dựng công phu, từ săn quái vật huyền thoại đến giải quyết các mâu thuẫn xã hội phức tạp. Hai bản mở rộng Blood and Wine và Hearts of Stone bổ sung thêm hàng chục giờ chơi với cốt truyện và khu vực mới. Với đồ họa tuyệt đẹp, âm nhạc hùng tráng, và một câu chuyện giàu cảm xúc, The Witcher 3 được coi là một kiệt tác của ngành công nghiệp game.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/w_2_tfo35u.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/w_1_hv9xms.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/w_3_phd89o.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377061/w_4_fkaxea.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377061/w_5_w1d1es.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/w_2_tfo35u.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit, Windows 8.1 64 Bit.",
        "cpu": "Intel Core i5-2500K 3.3GHz / AMD Phenom II X4 940.",
        "ram": "6 GB.",
        "gpu": "NVIDIA GTX 660 / AMD Radeon HD 7870.",
        "disk": "35 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-3770 3.4GHz / AMD FX-8350 4GHz.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 770 / AMD Radeon R9 290.",
        "disk": "35 GB."
      },
      "price": 399000
    },
    {
      "id": "3",
      "name": "Cyberpunk 2077",
      "tags": [
        "role-playing",
        "action",
        "sci-fi"
      ],
      "details": {
        "publisher": "CD Projekt Red",
        "published_date": {
          "$date": "2020-12-10T00:00:00Z"
        },
        "describe": "Cyberpunk 2077 là một game nhập vai hành động thế giới mở lấy bối cảnh tại Night City, một siêu đô thị dystopian năm 2077, nơi công nghệ tiên tiến và bất bình đẳng xã hội hòa quyện. Người chơi hóa thân thành V, một lính đánh thuê có thể tùy chỉnh giới tính, ngoại hình, và kỹ năng, bắt đầu hành trình từ một kẻ vô danh đến một huyền thoại đô thị. Cốt truyện xoay quanh một con chip bí ẩn chứa đựng ý thức của Johnny Silverhand, một rockerboy nổi loạn do Keanu Reeves thủ vai, khiến V bị cuốn vào các âm mưu giữa các tập đoàn quyền lực và băng đảng đường phố. Lối chơi của Cyberpunk 2077 cho phép người chơi lựa chọn phong cách chiến đấu đa dạng: từ bắn súng, cận chiến, đến sử dụng hack công nghệ để điều khiển kẻ thù hoặc môi trường. Hệ thống lựa chọn đối thoại phân nhánh ảnh hưởng lớn đến cốt truyện, mang đến nhiều kết thúc khác nhau. Night City được xây dựng chi tiết với sáu khu vực độc đáo, từ trung tâm hào nhoáng đến các khu ổ chuột nguy hiểm, cùng hàng trăm hoạt động phụ như đua xe, săn tiền thưởng, và khám phá các bí mật công nghệ. Dù gặp nhiều tranh cãi khi ra mắt, các bản cập nhật lớn và bản mở rộng Phantom Liberty đã cải thiện đáng kể trải nghiệm, mang đến một thế giới sống động với đồ họa ngoạn mục và câu chuyện sâu sắc.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/cp_2_mmbmjp.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377061/cp_4_yugiig.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377061/cp_3_hmtetr.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377061/cp_1_jkeuy3.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377060/cp_5_mefkmf.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377062/cp_2_mmbmjp.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-3570K / AMD FX-8310.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 780 3GB / AMD Radeon RX 470.",
        "disk": "70 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-4790 / AMD Ryzen 3 3200G.",
        "ram": "12 GB.",
        "gpu": "NVIDIA GTX 1060 6GB / AMD Radeon R9 Fury.",
        "disk": "70 GB."
      },
      "price": 599000
    },
    {
      "id": "4",
      "name": "FIFA 23",
      "tags": [
        "sports",
        "simulation"
      ],
      "details": {
        "publisher": "EA Sports",
        "published_date": {
          "$date": "2022-09-30T00:00:00Z"
        },
        "describe": "FIFA 23 là tựa game mô phỏng bóng đá mới nhất từ EA Sports, mang đến trải nghiệm thể thao chân thực với công nghệ HyperMotion V2 tiên tiến, tái hiện chuyển động cầu thủ mượt mà và sống động hơn bao giờ hết. Trò chơi bao gồm hàng nghìn câu lạc bộ và đội tuyển từ các giải đấu lớn như Premier League, La Liga, Serie A, Bundesliga, và đặc biệt là FIFA World Cup 2022 cho cả nam và nữ. Người chơi có thể tham gia các chế độ chơi đa dạng: từ quản lý đội bóng trong Career Mode, xây dựng đội hình mơ ước trong FIFA Ultimate Team (FUT), đến trải nghiệm bóng đá đường phố trong Volta Football. FIFA 23 cũng giới thiệu bóng đá nữ với các giải đấu cấp câu lạc bộ, cùng tính năng chơi chéo (cross-play) giữa các nền tảng, cho phép bạn thi đấu trực tuyến với bạn bè trên PC, PlayStation, hoặc Xbox. Hệ thống vật lý và AI được cải tiến mang đến các pha bóng chân thực, từ sút xa, rê bóng, đến phòng ngự chiến thuật. Với đồ họa sắc nét, bình luận sống động, và âm thanh sân vận động cuồng nhiệt, FIFA 23 là lựa chọn hoàn hảo cho những người yêu thích bóng đá và muốn trải nghiệm cảm giác thi đấu đỉnh cao.",
        "age-limit": "3+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377060/ff_2_zdcbri.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377060/ff_1_yogmav.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377059/ff_3_qezjhy.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377059/ff_4_d9bxqs.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377058/ff_5_isdmt2.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377060/ff_1_yogmav.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-6600K / AMD Ryzen 5 1600.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1050 Ti / AMD Radeon RX 570.",
        "disk": "100 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-8700 / AMD Ryzen 7 2700X.",
        "ram": "12 GB.",
        "gpu": "NVIDIA GTX 1660 Super / AMD RX 5600 XT.",
        "disk": "100 GB."
      },
      "price": 799000
    },
    {
      "id": "5",
      "name": "Elden Ring",
      "tags": [
        "action",
        "role-playing",
        "fantasy"
      ],
      "details": {
        "publisher": "Bandai Namco Entertainment",
        "published_date": {
          "$date": "2022-02-25T00:00:00Z"
        },
        "describe": "Elden Ring là một kiệt tác nhập vai hành động thế giới mở từ FromSoftware, hợp tác với nhà văn George R.R. Martin, tác giả của Game of Thrones. Lấy bối cảnh vùng đất The Lands Between, nơi chiếc nhẫn Elden bị phá hủy, người chơi hóa thân thành Tarnished, một chiến binh được chọn để thu thập các mảnh vỡ của nhẫn và trở thành Elden Lord. Thế giới game rộng lớn, từ những đồng cỏ xanh tươi, đầm lầy độc hại, đến các lâu đài cổ kính và ngục tối bí ẩn, tất cả được thiết kế với sự chi tiết đáng kinh ngạc. Lối chơi của Elden Ring kế thừa phong cách Souls-like với độ khó cao, yêu cầu người chơi thành thạo chiến đấu, né tránh, và sử dụng phép thuật hoặc vũ khí đa dạng. Điểm nổi bật là sự tự do khám phá, cho phép người chơi chọn cách tiếp cận các khu vực, đối mặt với các boss hùng mạnh như Margit hay Malenia, hoặc khám phá các bí mật ẩn giấu. Cốt truyện được kể qua các chi tiết môi trường và đoạn hội thoại ngắn, tạo nên một câu chuyện huyền bí, đầy ẩn ý. Với đồ họa ngoạn mục, âm nhạc hoành tráng, và thiết kế thế giới đỉnh cao, Elden Ring đã được ca ngợi là một trong những game hay nhất mọi thời đại.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377059/er_2_x8fjld.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377059/er_1_q09vjm.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377057/er_3_o4si4x.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377057/er_4_s5o0yf.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/er_5_sjiy0q.webp"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/er_5_sjiy0q.webp",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-8400 / AMD Ryzen 3 3300X.",
        "ram": "12 GB.",
        "gpu": "NVIDIA GTX 1060 3GB / AMD Radeon RX 580 4GB.",
        "disk": "60 GB."
      },
      "recommended_configuration": {
        "os": "Windows 11 64 Bit.",
        "cpu": "Intel Core i7-8700K / AMD Ryzen 5 3600X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA GTX 1070 8GB / AMD Radeon RX Vega 56 8GB.",
        "disk": "60 GB."
      },
      "price": 699000
    },
    {
      "id": "6",
      "name": "Assassin’s Creed Valhalla",
      "tags": [
        "action",
        "adventure",
        "stealth"
      ],
      "details": {
        "publisher": "Ubisoft",
        "published_date": {
          "$date": "2020-11-10T00:00:00Z"
        },
        "describe": "Assassin’s Creed Valhalla là một game nhập vai hành động thế giới mở, đưa người chơi vào thời đại Viking thế kỷ 9 tại Anh. Người chơi hóa thân thành Eivor, một chiến binh Viking dũng mãnh (có thể chọn giới tính), dẫn dắt bộ tộc Raven từ Na Uy đến Anh để tìm kiếm một quê hương mới. Cốt truyện xoay quanh việc xây dựng khu định cư, chinh phục các vùng đất, và đối đầu với các vương quốc Anglo-Saxon, đồng thời khám phá bí ẩn về Hidden Ones và Templars, tiền thân của Assassins và Templar trong series. Lối chơi kết hợp chiến đấu đẫm máu với các vũ khí Viking như rìu, kiếm, và khiên, cùng các yếu tố lén lút đặc trưng của dòng Assassin’s Creed như ám sát từ bóng tối. Người chơi có thể tùy chỉnh kỹ năng của Eivor qua cây kỹ năng phong phú, từ chiến binh hung bạo đến sát thủ bí ẩn. Thế giới game rộng lớn, bao gồm các vùng đất như Mercia, Wessex, và Đông Anglia, với các hoạt động như cướp bóc tu viện, săn bắn, câu cá, hoặc tham gia các trận chiến quy mô lớn. Ngoài ra, game còn có các câu đố thần thoại Bắc Âu và các nhiệm vụ phụ đậm chất văn hóa Viking. Với đồ họa tuyệt đẹp, âm nhạc đậm chất sử thi, và cốt truyện sâu sắc, Valhalla mang đến trải nghiệm nhập vai hấp dẫn.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377060/ac_4_wof1ar.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/ac_3_qagswk.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/ac_2_zeheuu.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/ac_1_cfvchw.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377055/ac_5_zae3gc.webp"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377056/ac_1_cfvchw.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-4460 / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 960 4GB / AMD Radeon R9 380 4GB.",
        "disk": "50 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-6700 / AMD Ryzen 7 1700.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1080 8GB / AMD Vega 64.",
        "disk": "50 GB."
      },
      "price": 499000
    },
    {
      "id": "7",
      "name": "Minecraft",
      "tags": [
        "sandbox",
        "adventure",
        "survival"
      ],
      "details": {
        "publisher": "Mojang Studios",
        "published_date": {
          "$date": "2011-11-18T00:00:00Z"
        },
        "describe": "Minecraft là một hiện tượng toàn cầu trong thể loại game sandbox, nơi người chơi được thả vào một thế giới khối vuông vô hạn, được tạo ngẫu nhiên, để khám phá, xây dựng, và sinh tồn. Không có cốt truyện cố định, Minecraft cho phép người chơi tự do định hình trải nghiệm của mình: từ việc xây dựng những công trình kiến trúc đồ sộ như lâu đài, thành phố, đến khám phá các hang động sâu thẳm, chiến đấu với quái vật như Creeper, Zombie, hay Ender Dragon. Lối chơi chia thành các chế độ chính: Survival, nơi người chơi thu thập tài nguyên, chế tạo vật phẩm, và đối mặt với đói khát; Creative, nơi bạn có tài nguyên vô hạn để thỏa sức sáng tạo; và Adventure, tập trung vào khám phá các bản đồ tùy chỉnh. Thế giới Minecraft đa dạng với các quần xã sinh vật như rừng, sa mạc, đại dương, và Nether – một chiều không gian địa ngục đầy nguy hiểm. Game cũng hỗ trợ chơi đa người, cho phép bạn hợp tác hoặc cạnh tranh với bạn bè trên các máy chủ trực tuyến. Với các bản cập nhật liên tục như Caves & Cliffs hay Wild Update, Minecraft không ngừng mở rộng với các khối, sinh vật, và cơ chế mới. Đồ họa đơn giản nhưng quyến rũ, kết hợp với âm nhạc thư giãn, đã biến Minecraft thành một sân chơi sáng tạo dành cho mọi lứa tuổi.",
        "age-limit": "7+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377055/mc_1_wf11hk.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377054/mc_4_xnqrue.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377054/mc_3_afq8xv.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377054/mc_2_plgbzh.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/mc_5_fxaahn.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377055/mc_1_wf11hk.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core i3-3210 / AMD A8-7600 APU.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce 400 Series / AMD Radeon HD 7000 series.",
        "disk": "4 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-4690 / AMD A10-7800 APU.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GeForce 700 Series / AMD Radeon Rx 200 Series.",
        "disk": "4 GB."
      },
      "price": 199000
    },
    {
      "id": "8",
      "name": "Starfield",
      "tags": [
        "role-playing",
        "sci-fi",
        "exploration"
      ],
      "details": {
        "publisher": "Bethesda Softworks",
        "published_date": {
          "$date": "2023-09-06T00:00:00Z"
        },
        "describe": "Starfield là một game nhập vai khoa học viễn tưởng từ Bethesda Softworks, đưa người chơi vào vai một nhà thám hiểm vũ trụ trong thế kỷ 24, thuộc tổ chức Constellation, nhằm khám phá bí ẩn của thiên hà. Lấy bối cảnh một vũ trụ rộng lớn với hơn 1.000 hành tinh có thể khám phá, từ các hành tinh băng giá, sa mạc khô cằn, đến các siêu đô thị như New Atlantis, Starfield mang đến tự do chưa từng có trong việc du hành không gian. Người chơi có thể tùy chỉnh nhân vật, từ ngoại hình, kỹ năng, đến lịch sử cá nhân, ảnh hưởng đến các tương tác trong game. Lối chơi kết hợp khám phá thế giới mở, chiến đấu (bắn súng và cận chiến), xây dựng tàu vũ trụ, và quản lý căn cứ. Bạn có thể thiết kế tàu vũ trụ với hàng trăm module, tham gia các trận chiến không gian kịch tính, hoặc khai thác tài nguyên trên các hành tinh. Cốt truyện chính xoay quanh việc tìm kiếm các Artifact bí ẩn, nhưng game cũng cung cấp hàng trăm nhiệm vụ phụ, từ làm phi hành gia, cướp biển không gian, đến gia nhập các phe phái như United Colonies hay Freestar Collective. Với đồ họa ấn tượng, hệ thống mô phỏng không gian chân thực, và câu chuyện sâu sắc, Starfield là một hành trình vũ trụ đầy tham vọng cho những ai yêu thích khám phá.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377054/sf_1_x9gr7v.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/sf_4_can7da.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/sf_3_tze8o5.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/sf_2_hzypxu.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377052/sf_5_e2cvwf.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377054/sf_1_x9gr7v.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-6800K / AMD Ryzen 5 2600X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA GTX 1070 Ti / AMD Radeon RX 5700.",
        "disk": "125 GB."
      },
      "recommended_configuration": {
        "os": "Windows 11 64 Bit.",
        "cpu": "Intel Core i5-10600K / AMD Ryzen 5 3600X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA RTX 2080 / AMD Radeon RX 6800 XT.",
        "disk": "125 GB."
      },
      "price": 799000
    },
    {
      "id": "9",
      "name": "Red Dead Redemption 2",
      "tags": [
        "action",
        "adventure",
        "open-world"
      ],
      "details": {
        "publisher": "Rockstar Games",
        "published_date": {
          "$date": "2018-10-26T00:00:00Z"
        },
        "describe": "Red Dead Redemption 2 là một siêu phẩm hành động phiêu lưu thế giới mở từ Rockstar Games, lấy bối cảnh miền Tây hoang dã của nước Mỹ năm 1899, khi thời kỳ cao bồi đang dần tàn lụi. Người chơi hóa thân thành Arthur Morgan, một thành viên trung thành của băng đảng Van der Linde, sống ngoài vòng pháp luật trong một thế giới đầy nguy hiểm và thay đổi. Cốt truyện kể về hành trình của Arthur và băng đảng khi họ chạy trốn sự truy đuổi của pháp luật và các băng nhóm đối thủ, đồng thời đối mặt với mâu thuẫn nội bộ và những câu hỏi về lòng trung thành, danh dự, và sự chuộc lỗi. Thế giới game rộng lớn, từ các thị trấn bụi bặm, đồng cỏ mênh mông, đến núi tuyết và đầm lầy, được xây dựng với sự chi tiết đáng kinh ngạc. Lối chơi cho phép người chơi tự do khám phá, tham gia các hoạt động như cướp tàu, săn bắn, cưỡi ngựa, hoặc tương tác với hàng trăm nhân vật phụ có câu chuyện riêng. Hệ thống chiến đấu kết hợp bắn súng, cận chiến, và cơ chế Dead Eye cho phép làm chậm thời gian để nhắm bắn chính xác. Các quyết định của người chơi ảnh hưởng đến danh tiếng của Arthur và cách các nhân vật khác phản ứng với anh ta. Với đồ họa chân thực, âm nhạc cảm xúc, và cốt truyện sâu sắc, Red Dead Redemption 2 là một trải nghiệm nhập vai không thể bỏ qua.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/rdr_1_ldq4el.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377053/rdr_2_y6xwis.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377052/rdr_3_ksdikm.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377052/rdr_4_hbppn0.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/rdr_5_ehmilh.webp"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377052/rdr_3_ksdikm.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD FX-6300.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 770 2GB / AMD Radeon R9 280 3GB.",
        "disk": "150 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-4770K / AMD Ryzen 5 1500X.",
        "ram": "12 GB.",
        "gpu": "NVIDIA GTX 1060 6GB / AMD Radeon RX 480 4GB.",
        "disk": "150 GB."
      },
      "price": 599000
    },
    {
      "id": "10",
      "name": "DOOM Eternal",
      "tags": [
        "action",
        "shooter",
        "fps"
      ],
      "details": {
        "publisher": "Bethesda Softworks",
        "published_date": {
          "$date": "2020-03-20T00:00:00Z"
        },
        "describe": "DOOM Eternal là phần tiếp theo của dòng game bắn súng góc nhìn thứ nhất huyền thoại từ id Software, mang đến trải nghiệm hành động mãnh liệt và nhịp độ cực nhanh. Người chơi vào vai Doom Slayer, một chiến binh bất tử, tiếp tục cuộc chiến chống lại đội quân quỷ dữ từ địa ngục đang xâm chiếm Trái Đất và các chiều không gian khác. Cốt truyện đưa bạn qua các địa điểm từ Trái Đất bị tàn phá, các hành tinh xa xôi, đến những pháo đài địa ngục đầy rẫy quái vật kinh dị như Marauder, Archvile, hay Icon of Sin. Lối chơi của DOOM Eternal tập trung vào sự di chuyển liên tục, kết hợp bắn súng, cận chiến, và các kỹ năng như nhảy đôi, lao nhanh (dash), để tiêu diệt kẻ thù một cách sáng tạo. Hệ thống vũ khí đa dạng, từ súng shotgun, plasma rifle, đến BFG 9000, có thể được nâng cấp để tăng sức mạnh. Game yêu cầu người chơi quản lý tài nguyên như máu, đạn, và giáp thông qua các pha “Glory Kill” đẫm máu. Ngoài chiến dịch một người chơi đầy kịch tính, DOOM Eternal còn có chế độ Battlemode, nơi một người chơi điều khiển Doom Slayer đấu với hai người khác trong vai quỷ. Với đồ họa chi tiết, âm nhạc metal cuồng nhiệt, và thiết kế màn chơi sáng tạo, DOOM Eternal là thiên đường cho những ai yêu thích hành động không khoan nhượng.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/de_1_becde1.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377050/de_3_nqrwnr.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/de_5_ltti6b.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/de_4_fmqw0z.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/de_1_becde1.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/de_1_becde1.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1050 Ti / AMD Radeon R9 280.",
        "disk": "50 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-6700K / AMD Ryzen 7 1800X.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1080 / AMD Radeon RX Vega 56.",
        "disk": "50 GB."
      },
      "price": 399000
    },
    {
      "id": "11",
      "name": "Horizon Zero Dawn",
      "tags": [
        "action",
        "role-playing",
        "adventure"
      ],
      "details": {
        "publisher": "Sony Interactive Entertainment",
        "published_date": {
          "$date": "2020-08-07T00:00:00Z"
        },
        "describe": "Horizon Zero Dawn là một game nhập vai hành động thế giới mở từ Guerrilla Games, lấy bối cảnh một thế giới hậu tận thế nơi con người sống trong các bộ lạc nguyên thủy, nhưng bị thống trị bởi các cỗ máy sinh học khổng lồ. Người chơi điều khiển Aloy, một thợ săn trẻ tuổi bị ruồng bỏ, trên hành trình khám phá nguồn gốc của mình và bí ẩn về thế giới xung quanh. Cốt truyện kết hợp giữa khoa học viễn tưởng và thần thoại, đưa người chơi qua các khu rừng rậm rạp, sa mạc khô cằn, và các tàn tích công nghệ cổ đại. Lối chơi xoay quanh việc săn lùng và chiến đấu với các cỗ máy như Thunderjaw hay Stormbird, sử dụng cung tên, bẫy, và các vũ khí chế tạo từ linh kiện máy. Aloy có thể thu thập tài nguyên, nâng cấp kỹ năng, và sử dụng thiết bị công nghệ như Focus để phân tích kẻ thù và môi trường. Ngoài các nhiệm vụ chính, game cung cấp các hoạt động phụ như săn bắn, giải câu đố, và khám phá các lăng mộ công nghệ chứa đựng bí mật về nền văn minh cũ. Bản mở rộng The Frozen Wilds bổ sung một khu vực băng giá và cốt truyện mới. Với đồ họa ngoạn mục, cốt truyện hấp dẫn, và thế giới sống động, Horizon Zero Dawn là một hành trình khó quên.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/hzd_1_bmmw9g.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/hzd_3_qouiw5.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/hzd_4_psltav.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/hzd_2_datokf.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377047/hzd_5_f8s9tt.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/hzd_1_bmmw9g.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD FX-6300.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 780 3GB / AMD Radeon R9 290 4GB.",
        "disk": "100 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-4770K / AMD Ryzen 5 1500X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA GTX 1060 6GB / AMD Radeon RX 580 8GB.",
        "disk": "100 GB."
      },
      "price": 499000
    },
    {
      "id": "12",
      "name": "The Sims 4",
      "tags": [
        "simulation",
        "life-sim"
      ],
      "details": {
        "publisher": "Electronic Arts",
        "published_date": {
          "$date": "2014-09-02T00:00:00Z"
        },
        "describe": "The Sims 4 là tựa game mô phỏng cuộc sống nổi tiếng từ Electronic Arts, nơi người chơi tạo và điều khiển các nhân vật Sim trong một thế giới ảo đầy màu sắc. Bạn có thể tùy chỉnh mọi khía cạnh của Sim, từ ngoại hình, tính cách, đến ước mơ và mục tiêu cuộc sống. Lối chơi tập trung vào việc quản lý cuộc sống hàng ngày của Sim, bao gồm xây dựng nhà cửa, phát triển sự nghiệp, duy trì mối quan hệ, và thỏa mãn các nhu cầu như ăn uống, ngủ nghỉ, hay giải trí. Thế giới của The Sims 4 bao gồm nhiều khu phố như Willow Creek, Oasis Springs, và các khu vực mở rộng qua các bản DLC như San Myshuno (thành phố) hay Sulani (đảo nhiệt đới). Game cung cấp hàng trăm hoạt động, từ tổ chức tiệc tùng, nuôi thú cưng, đến khám phá các nghề nghiệp như bác sĩ, đầu bếp, hay thậm chí là phù thủy. Hệ thống cảm xúc của Sim ảnh hưởng đến hành vi và tương tác, tạo nên những câu chuyện độc đáo dựa trên lựa chọn của người chơi. Với các bản mở rộng như Seasons, Cats & Dogs, và Cottage Living, The Sims 4 không ngừng mở rộng với các tính năng mới. Đồ họa tươi sáng, lối chơi sáng tạo, và khả năng tùy chỉnh gần như vô hạn khiến The Sims 4 trở thành sân chơi lý tưởng cho trí tưởng tượng.",
        "age-limit": "12+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/ts_4_cwf0tf.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377051/ts_3_jiszsa.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377050/ts_5_gu52sr.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/ts_2_t8emkr.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/ts_1_g8zzxq.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/ts_1_g8zzxq.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core 2 Duo E4300 / AMD Athlon 64 X2 4000+.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce 6600 / AMD Radeon X1300.",
        "disk": "15 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-750 / AMD Athlon X4.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 650 / AMD Radeon HD 7750.",
        "disk": "15 GB."
      },
      "price": 299000
    },
    {
      "id": "13",
      "name": "Battlefield 2042",
      "tags": [
        "shooter",
        "fps",
        "multiplayer"
      ],
      "details": {
        "publisher": "Electronic Arts",
        "published_date": {
          "$date": "2021-11-19T00:00:00Z"
        },
        "describe": "Battlefield 2042 là tựa game bắn súng góc nhìn thứ nhất từ DICE, lấy bối cảnh một thế giới tương lai gần năm 2042, nơi biến đổi khí hậu và xung đột địa chính trị đẩy nhân loại vào chiến tranh toàn cầu. Trò chơi tập trung vào trải nghiệm đa người chơi quy mô lớn, hỗ trợ đến 128 người chơi trên các bản đồ rộng lớn như sa mạc Antarctica, cảng Singapore, hay thành phố Seoul bị phá hủy. Lối chơi của Battlefield 2042 nổi bật với các chế độ như Conquest (chiếm điểm), Breakthrough (tấn công/phòng thủ), và Hazard Zone (chiến đấu đội nhỏ để thu thập dữ liệu). Hệ thống Specialists giới thiệu các nhân vật với kỹ năng đặc biệt, như lính trinh sát với drone hay kỹ sư với khiên chống đạn, mang đến sự đa dạng trong chiến thuật. Game cũng tích hợp các sự kiện thời tiết động như bão cát hay lốc xoáy, ảnh hưởng trực tiếp đến chiến trường. Người chơi có thể tùy chỉnh vũ khí theo thời gian thực và sử dụng các phương tiện như xe tăng, trực thăng, hoặc jet để tạo lợi thế. Dù gặp một số vấn đề kỹ thuật khi ra mắt, các bản cập nhật đã cải thiện đáng kể trải nghiệm. Với đồ họa ấn tượng, âm thanh chiến trường sống động, và quy mô chiến đấu hoành tráng, Battlefield 2042 là lựa chọn tuyệt vời cho fan của thể loại FPS đa người chơi.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377050/bf_2_tfu9hs.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377050/bf_1_nzgzbx.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/bf_4_kuhgnd.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/bf_5_zujzhs.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377049/bf_3_edqqxo.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377050/bf_2_tfu9hs.webp",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-6600K / AMD Ryzen 5 1600.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1050 Ti / AMD Radeon RX 560.",
        "disk": "100 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-8700 / AMD Ryzen 7 2700X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA RTX 3060 / AMD Radeon RX 6600 XT.",
        "disk": "100 GB."
      },
      "price": 699000
    },
    {
      "id": "14",
      "name": "Portal 2",
      "tags": [
        "puzzle",
        "platformer",
        "sci-fi"
      ],
      "details": {
        "publisher": "Valve Corporation",
        "published_date": {
          "$date": "2011-04-19T00:00:00Z"
        },
        "describe": "Portal 2 là một game giải đố góc nhìn thứ nhất từ Valve, được yêu thích nhờ lối chơi sáng tạo và câu chuyện hài hước. Người chơi vào vai Chell, một nhân vật thử nghiệm bị mắc kẹt trong phòng thí nghiệm Aperture Science, được dẫn dắt bởi trí tuệ nhân tạo GLaDOS đầy mưu mô. Lối chơi xoay quanh việc sử dụng Portal Gun, một thiết bị cho phép tạo hai cổng dịch chuyển để di chuyển qua các bức tường, sàn nhà, và giải các câu đố vật lý phức tạp. Các màn chơi được thiết kế thông minh, yêu cầu người chơi suy nghĩ sáng tạo để vượt qua các chướng ngại vật như laser, tháp pháo, hay hố sâu. Ngoài chiến dịch một người chơi, Portal 2 còn có chế độ co-op, nơi hai người chơi điều khiển robot Atlas và P-Body để giải các câu đố hợp tác. Cốt truyện được kể qua các đoạn hội thoại hóm hỉnh, đặc biệt là sự tương tác giữa GLaDOS và nhân vật Wheatley, mang đến những khoảnh khắc hài hước đáng nhớ. Với thiết kế màn chơi xuất sắc, nhạc nền độc đáo, và câu chuyện giàu cảm xúc, Portal 2 không chỉ là một game giải đố mà còn là một tác phẩm nghệ thuật, phù hợp cho cả người mới và fan của thể loại puzzle.",
        "age-limit": "10+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/p_4_j33iow.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/p_2_xn4t6m.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/p_1_kvapjw.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377047/p_5_xz6no3.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377047/p_3_s324da.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377048/p_1_kvapjw.jpg",
      "minimum_configuration": {
        "os": "Windows 7 32 Bit.",
        "cpu": "Intel Pentium 4 3.0GHz / AMD equivalent.",
        "ram": "2 GB.",
        "gpu": "NVIDIA GeForce 7600 / AMD Radeon X800.",
        "disk": "8 GB."
      },
      "recommended_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core 2 Duo E6600 / AMD Phenom X3 8750.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce GTX 260 / AMD Radeon HD 4850.",
        "disk": "8 GB."
      },
      "price": 129000
    },
    {
      "id": "15",
      "name": "Hollow Knight",
      "tags": [
        "metroidvania",
        "action",
        "adventure"
      ],
      "details": {
        "publisher": "Team Cherry",
        "published_date": {
          "$date": "2017-02-24T00:00:00Z"
        },
        "describe": "Hollow Knight là một game hành động phiêu lưu 2D thuộc thể loại Metroidvania, được phát triển bởi Team Cherry. Người chơi điều khiển Knight, một hiệp sĩ nhỏ bé, khám phá vương quốc ngầm Hallownest, một thế giới đổ nát đầy côn trùng và những sinh vật kỳ dị. Cốt truyện được kể qua các chi tiết môi trường và hội thoại ngắn, hé lộ bí ẩn về sự sụp đổ của Hallownest và vai trò của Knight trong việc cứu vãn hoặc phá hủy nó. Lối chơi kết hợp chiến đấu nhanh, nhảy nhót chính xác, và khám phá bản đồ rộng lớn với các khu vực như Greenpath tươi tốt, Fungal Wastes ẩm ướt, hay City of Tears u ám. Người chơi có thể nâng cấp khả năng của Knight, từ đinh ghim (nail) để chiến đấu, đến các phép thuật như lao bóng tối hay bắn hồn. Game nổi tiếng với độ khó cao, đặc biệt khi đối mặt với các boss như Hornet hay Nightmare King Grimm, nhưng luôn công bằng và thỏa mãn khi vượt qua. Các bản mở rộng miễn phí như Godmaster và Lifeblood bổ sung thêm nội dung và thử thách. Với đồ họa vẽ tay tuyệt đẹp, âm nhạc ám ảnh, và thế giới giàu chi tiết, Hollow Knight là một kiệt tác indie dành cho những ai yêu thích khám phá và thử thách.",
        "age-limit": "10+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377047/hk_1_tdpdt5.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/hk_5_xo7a6n.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/hk_2_tvwski.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377046/hk_3_nb7lrc.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377045/hk_4_l51whl.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746377047/hk_1_tdpdt5.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core 2 Duo E5200.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce 9800 GTX / AMD equivalent.",
        "disk": "9 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i3-530.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GeForce GTX 460 / AMD Radeon HD 6850.",
        "disk": "9 GB."
      },
      "price": 149000
    },
    {
      "id": "16",
      "name": "God of War (2018)",
      "tags": [
        "action",
        "adventure",
        "mythology"
      ],
      "details": {
        "publisher": "Sony Interactive Entertainment",
        "published_date": {
          "$date": "2022-01-14T00:00:00Z"
        },
        "describe": "God of War (2018) là một cuộc tái định nghĩa ngoạn mục cho dòng game hành động từ Santa Monica Studio, đưa Kratos, vị thần chiến tranh của thần thoại Hy Lạp, vào một hành trình mới trong thế giới thần thoại Bắc Âu. Sau khi rời bỏ quá khứ đẫm máu, Kratos giờ sống ẩn dật ở vùng đất Midgard cùng cậu con trai Atreus. Cốt truyện bắt đầu khi vợ của Kratos qua đời, để lại di nguyện rải tro của cô trên đỉnh núi cao nhất trong chín cõi. Hành trình của cha con Kratos và Atreus đưa họ qua các vùng đất huyền bí như Alfheim, Helheim, và Jotunheim, đối mặt với các sinh vật thần thoại như rồng, yêu tinh, và các vị thần Bắc Âu như Baldur và Freya. Lối chơi kết hợp chiến đấu dữ dội với rìu Leviathan có thể ném và triệu hồi, cùng các kỹ năng của Atreus như bắn cung và triệu hồi thú. Game cũng có các yếu tố nhập vai, cho phép nâng cấp vũ khí, giáp, và kỹ năng qua tài nguyên thu thập được. Ngoài chiến đấu, người chơi phải giải các câu đố môi trường và khám phá các bí mật về các cõi. Với góc quay liền mạch không cắt cảnh, đồ họa tuyệt đẹp, và câu chuyện cảm động về tình cha con, God of War là một kiệt tác hành động đầy cảm xúc.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023558/gow_2_lsf9jj.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023558/gow_3_wnh4vj.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023558/gow_4_josmoe.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023558/gow_5_iltgpv.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/gow_1_aktebb.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/gow_1_aktebb.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 960 4GB / AMD Radeon R9 290X 4GB.",
        "disk": "70 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-6600K / AMD Ryzen 5 2400G.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1060 6GB / AMD RX 570 4GB.",
        "disk": "70 GB."
      },
      "price": 599000
    },
    {
      "id": "17",
      "name": "Among Us",
      "tags": [
        "party",
        "multiplayer",
        "social-deduction"
      ],
      "details": {
        "publisher": "Innersloth",
        "published_date": {
          "$date": "2018-11-16T00:00:00Z"
        },
        "describe": "Among Us là một game đa người chơi thuộc thể loại suy luận xã hội, đã trở thành hiện tượng toàn cầu nhờ lối chơi đơn giản nhưng gây nghiện. Lấy bối cảnh một tàu vũ trụ, trạm không gian, hoặc căn cứ trên hành tinh, người chơi được chia thành hai vai: Crewmates (phi hành đoàn) và Impostors (kẻ giả mạo). Crewmates phải hoàn thành các nhiệm vụ nhỏ như sửa hệ thống điện, đổ rác, hoặc quét thẻ, đồng thời cố gắng tìm ra Impostors trước khi bị tiêu diệt. Impostors, trong khi đó, phải lén lút phá hoại tàu, ám sát Crewmates, và đánh lạc hướng bằng cách giả vờ làm nhiệm vụ. Lối chơi xoay quanh các cuộc họp khẩn cấp, nơi người chơi thảo luận và bỏ phiếu để loại bỏ nghi phạm, tạo nên những khoảnh khắc căng thẳng và hài hước. Game hỗ trợ 4-15 người chơi, với các bản đồ như The Skeld, Mira HQ, và Airship, mỗi bản đồ có cơ chế và nhiệm vụ riêng. Các bản cập nhật đã bổ sung vai trò mới như Scientist, Engineer, và Shapeshifter, tăng thêm sự đa dạng. Với đồ họa hoạt hình dễ thương, lối chơi dễ tiếp cận, và tính tương tác cao, Among Us là lựa chọn hoàn hảo cho các buổi chơi nhóm, đặc biệt khi bạn muốn thử thách khả năng lừa dối hoặc suy luận của mình.",
        "age-limit": "7+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023552/as_5_zievk4.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/as_4_k8zoip.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023550/as_2_hknrn2.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023550/as_1_sakxyy.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023550/as_3_dor7az.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023550/as_2_hknrn2.jpg",
      "minimum_configuration": {
        "os": "Windows 7 32 Bit.",
        "cpu": "Intel Pentium 4 2.0GHz / AMD equivalent.",
        "ram": "1 GB.",
        "gpu": "Intel HD Graphics 2000.",
        "disk": "250 MB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core 2 Duo E8400.",
        "ram": "2 GB.",
        "gpu": "NVIDIA GeForce 510.",
        "disk": "250 MB."
      },
      "price": 69000
    },
    {
      "id": "18",
      "name": "Resident Evil Village",
      "tags": [
        "horror",
        "action",
        "survival"
      ],
      "details": {
        "publisher": "Capcom",
        "published_date": {
          "$date": "2021-05-07T00:00:00Z"
        },
        "describe": "Resident Evil Village (Resident Evil 8) là một game kinh dị sinh tồn từ Capcom, tiếp nối câu chuyện của Resident Evil 7. Người chơi vào vai Ethan Winters, một người cha tuyệt vọng tìm kiếm cô con gái Rose bị bắt cóc, đưa anh đến một ngôi làng bí ẩn ở Đông Âu bị bao phủ bởi tuyết và sương mù. Ngôi làng được cai trị bởi bốn lãnh chúa kỳ dị, bao gồm Lady Dimitrescu – một nữ ma cà rồng khổng lồ nổi tiếng – và Mother Miranda, một nhân vật bí ẩn đứng sau mọi chuyện. Lối chơi kết hợp giữa kinh dị sinh tồn căng thẳng và hành động góc nhìn thứ nhất, với các màn chiến đấu chống lại quái vật như người sói (Lycan), ma cà rồng, và các sinh vật ghê rợn khác. Ethan sử dụng các vũ khí như súng ngắn, shotgun, và dao, đồng thời phải quản lý tài nguyên như đạn dược và thuốc hồi máu. Game cũng có các câu đố môi trường, yêu cầu người chơi khám phá lâu đài Dimitrescu, nhà máy Heisenberg, và các địa điểm khác để tiến triển. Ngoài cốt truyện chính, Resident Evil Village còn có chế độ Mercenaries, nơi người chơi chiến đấu với làn sóng kẻ thù để đạt điểm cao. Với đồ họa đẹp mắt, bầu không khí kinh dị ám ảnh, và cốt truyện hấp dẫn, Village là một trải nghiệm kinh dị đỉnh cao cho fan của dòng Resident Evil.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023564/rev_4_vimz6h.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023564/rev_5_ijkuda.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023563/rev_2_mridlh.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023562/rev_1_xnpu1o.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023564/rev_3_gfmdix.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023563/rev_2_mridlh.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-7500 / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1050 Ti / AMD Radeon RX 560.",
        "disk": "45 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-8700 / AMD Ryzen 5 3600.",
        "ram": "16 GB.",
        "gpu": "NVIDIA GTX 1070 / AMD Radeon RX 5700.",
        "disk": "45 GB."
      },
      "price": 499000
    },
    {
      "id": "19",
      "name": "Stardew Valley",
      "tags": [
        "simulation",
        "farming",
        "indie"
      ],
      "details": {
        "publisher": "ConcernedApe",
        "published_date": {
          "$date": "2016-02-26T00:00:00Z"
        },
        "describe": "Stardew Valley là một game mô phỏng nông trại độc lập từ ConcernedApe, mang đến trải nghiệm thư giãn và đầy ý nghĩa trong một thế giới pixel art quyến rũ. Người chơi thừa hưởng một trang trại cũ nát ở thung lũng Stardew và bắt đầu hành trình biến nó thành một nông trại thịnh vượng. Lối chơi xoay quanh việc trồng trọt, chăn nuôi, khai thác mỏ, câu cá, và chế tạo, với mỗi mùa trong game (xuân, hạ, thu, đông) mang đến các hoạt động và cây trồng khác nhau. Ngoài công việc nông trại, người chơi có thể xây dựng mối quan hệ với hơn 30 dân làng, từ kết bạn, yêu đương, đến kết hôn và lập gia đình. Game cũng có các yếu tố phiêu lưu, khi người chơi khám phá mỏ Skull Cavern, chiến đấu với quái vật, hoặc tìm kiếm các kho báu ẩn. Stardew Valley cung cấp một cốt truyện nhẹ nhàng, liên quan đến việc khôi phục trung tâm cộng đồng hoặc đối đầu với tập đoàn Joja, với các lựa chọn ảnh hưởng đến kết cục. Các bản cập nhật miễn phí đã bổ sung chế độ co-op, các khu vực mới như Ginger Island, và nhiều nội dung tùy chỉnh. Với âm nhạc thư giãn, lối chơi gây nghiện, và chiều sâu đáng kinh ngạc, Stardew Valley là một viên ngọc indie dành cho những ai yêu thích sự sáng tạo và yên bình.",
        "age-limit": "7+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023568/sv_5_vivclp.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/sv_1_dx5fg8.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/sv_3_a6ovre.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/sv_2_yvbtwc.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/sv_4_da4le8.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/sv_3_a6ovre.jpg",
      "minimum_configuration": {
        "os": "Windows Vista 32 Bit.",
        "cpu": "Intel Core 2 Duo E4400 / AMD equivalent.",
        "ram": "2 GB.",
        "gpu": "256 MB video memory, shader model 3.0+.",
        "disk": "500 MB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i3-2100 / AMD equivalent.",
        "ram": "4 GB.",
        "gpu": "512 MB video memory.",
        "disk": "500 MB."
      },
      "price": 119000
    },
    {
      "id": "20",
      "name": "Sekiro: Shadows Die Twice",
      "tags": [
        "action",
        "adventure",
        "stealth"
      ],
      "details": {
        "publisher": "Activision",
        "published_date": {
          "$date": "2019-03-22T00:00:00Z"
        },
        "describe": "Sekiro: Shadows Die Twice là một game hành động phiêu lưu từ FromSoftware, lấy bối cảnh Nhật Bản thời Sengoku thế kỷ 16, khi các lãnh chúa tranh giành quyền lực trong khói lửa chiến tranh. Người chơi vào vai Wolf, một shinobi bị phản bội, trên hành trình trả thù và bảo vệ chủ nhân của mình, Hoàng tử Divine Heir. Cốt truyện xoay quanh lòng trung thành, danh dự, và sự bất tử, với các yếu tố thần thoại như máu rồng và các thực thể siêu nhiên. Lối chơi của Sekiro tập trung vào chiến đấu chính xác và lén lút, với hệ thống “Posture” yêu cầu người chơi phá vỡ thế thủ của kẻ thù thông qua các đòn đánh, đỡ đòn, và phản công kịp thời. Khác với các game Souls khác, Sekiro nhấn mạnh cơ chế phục sinh, cho phép người chơi hồi sinh ngay tại chỗ để tiếp tục chiến đấu hoặc rút lui. Người chơi có thể sử dụng các công cụ shinobi như móc kéo, phi tiêu, hoặc bom khói để tạo lợi thế. Thế giới game được thiết kế liên kết chặt chẽ, từ các ngôi đền đổ nát, làng mạc cháy rụi, đến các lâu đài trên vách đá, với các boss thử thách như Genichiro Ashina hay Isshin, the Sword Saint. Với đồ họa đậm chất Nhật Bản, âm nhạc truyền cảm, và độ khó đầy thử thách, Sekiro là một trải nghiệm độc đáo cho những ai yêu thích hành động và chiến thuật.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/ssdt_5_yuweic.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023567/ssdt_4_adhgbz.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023566/ssdt_1_dj3dnv.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023566/ssdt_3_ctwftr.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023566/ssdt_2_ysnqqp.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023566/ssdt_1_dj3dnv.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core i3-2100 / AMD FX-6300.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GTX 760 / AMD Radeon HD 7950.",
        "disk": "25 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD Ryzen 5 1400.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 970 / AMD Radeon RX 570.",
        "disk": "25 GB."
      },
      "price": 499000
    },
    {
      "id": "21",
      "name": "Overwatch 2",
      "tags": [
        "shooter",
        "fps",
        "multiplayer"
      ],
      "details": {
        "publisher": "Blizzard Entertainment",
        "published_date": {
          "$date": "2022-10-04T00:00:00Z"
        },
        "describe": "Overwatch 2 là phần tiếp theo của game bắn súng đồng đội nổi tiếng từ Blizzard Entertainment, mang đến trải nghiệm FPS đa người chơi tập trung vào phối hợp và chiến thuật. Lấy bối cảnh một thế giới tương lai nơi các anh hùng từ khắp nơi tụ họp để bảo vệ hòa bình, game giới thiệu hơn 35 nhân vật (Heroes) với vai trò Tank, Damage, và Support, mỗi người có kỹ năng và lối chơi độc đáo, từ Reinhardt với khiên khổng lồ, Tracer với khả năng dịch chuyển, đến Mercy với sức mạnh hồi máu. Lối chơi của Overwatch 2 xoay quanh các trận đấu 5v5, với các chế độ như Escort (hộ tống hàng), Push (đẩy robot), và Control (chiếm điểm). Ngoài các trận đấu PvP, game còn có các nhiệm vụ PvE (chơi cùng chống AI), nơi người chơi hợp tác để hoàn thành các chiến dịch cốt truyện chống lại thế lực Null Sector. Overwatch 2 sử dụng mô hình miễn phí, với các vật phẩm trang trí và Battle Pass để tùy chỉnh nhân vật. Các bản đồ đa dạng, từ Paris lãng mạn, Route 66 đậm chất cao bồi, đến Antarctic Peninsula băng giá, mang đến chiến trường sống động. Với đồ họa rực rỡ, lối chơi nhanh, và cộng đồng sôi động, Overwatch 2 là lựa chọn lý tưởng cho những ai yêu thích FPS đồng đội.",
        "age-limit": "12+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/ow_5_e4rzh2.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023564/ow_4_ng9jnx.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023564/ow_3_vpqark.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023562/ow_2_c4k5fr.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023560/ow_1_nffzgx.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/ow_5_e4rzh2.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i3-3250 / AMD Phenom X4 9850.",
        "ram": "6 GB.",
        "gpu": "NVIDIA GTX 600 Series / AMD Radeon HD 7000 Series.",
        "disk": "50 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-6700K / AMD Ryzen 5 1600.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1060 / AMD Radeon R9 390.",
        "disk": "50 GB."
      },
      "price": 0
    },
    {
      "id": "22",
      "name": "Baldur’s Gate 3",
      "tags": [
        "role-playing",
        "strategy",
        "fantasy"
      ],
      "details": {
        "publisher": "Larian Studios",
        "published_date": {
          "$date": "2023-08-03T00:00:00Z"
        },
        "describe": "Baldur’s Gate 3 là một game nhập vai chiến thuật đỉnh cao từ Larian Studios, dựa trên hệ thống Dungeons & Dragons 5E. Lấy bối cảnh vùng Forgotten Realms, người chơi tạo một nhân vật tùy chỉnh (từ chủng tộc như Elf, Human, đến lớp nhân vật như Wizard, Rogue) và bị cuốn vào một cuộc phiêu lưu sau khi bị ký sinh bởi một con Mind Flayer. Cốt truyện xoay quanh việc tìm cách loại bỏ ký sinh trùng, đồng thời đối mặt với các thế lực như Cult of the Absolute, goblins, và các sinh vật huyền bí. Lối chơi kết hợp chiến đấu theo lượt với hệ thống xúc xắc D&D, yêu cầu người chơi tính toán chiến thuật, sử dụng phép thuật, kỹ năng, và môi trường để chiến thắng. Ngoài chiến đấu, game nổi bật với hệ thống đối thoại phân nhánh, nơi mỗi lựa chọn có thể thay đổi cốt truyện, mối quan hệ với đồng đội, và kết thúc của game. Thế giới được xây dựng chi tiết, từ khu rừng Druid Grove, Shadow-Cursed Lands, đến thành phố Baldur’s Gate, với hàng trăm nhiệm vụ phụ và bí mật để khám phá. Game hỗ trợ chơi đơn và co-op lên đến 4 người, mang đến trải nghiệm nhập vai phong phú. Với đồ họa tuyệt đẹp, lồng tiếng xuất sắc, và chiều sâu cốt truyện, Baldur’s Gate 3 là một kiệt tác dành cho fan RPG.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/bg_5_rtx9um.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023553/bg_2_a9bcie.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023553/bg_3_tuxeem.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023553/bg_4_ztbpdk.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023552/bg_1_crnzwe.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023552/bg_1_crnzwe.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-4690 / AMD FX-8350.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 970 / AMD Radeon RX 480.",
        "disk": "150 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-8700K / AMD Ryzen 5 3600.",
        "ram": "16 GB.",
        "gpu": "NVIDIA RTX 2060 Super / AMD Radeon RX 5700 XT.",
        "disk": "150 GB."
      },
      "price": 699000
    },
    {
      "id": "23",
      "name": "Rocket League",
      "tags": [
        "sports",
        "racing",
        "multiplayer"
      ],
      "details": {
        "publisher": "Psyonix",
        "published_date": {
          "$date": "2015-07-07T00:00:00Z"
        },
        "describe": "Rocket League là một game thể thao độc đáo từ Psyonix, kết hợp bóng đá với đua xe trong một sân chơi tốc độ cao. Người chơi điều khiển những chiếc xe được trang bị động cơ tên lửa, có khả năng bay, lướt, và va chạm để đưa bóng vào khung thành đối phương. Lấy bối cảnh các đấu trường tương lai với thiết kế đa dạng như sân bóng truyền thống, đấu trường băng tuyết, hay thành phố neon, game mang đến các trận đấu 1v1, 2v2, hoặc 3v3 đầy kịch tính. Lối chơi yêu cầu kỹ năng lái xe, phối hợp đồng đội, và chiến thuật, với các pha ghi bàn ngoạn mục nhờ boost, nhảy đôi, hoặc lộn nhào trên không. Ngoài chế độ bóng đá, Rocket League còn có các biến thể như Rumble (với power-up ngẫu nhiên), Hoops (bóng rổ), và Snow Day (khúc côn cầu). Game hỗ trợ chơi chéo giữa các nền tảng và có cộng đồng esports sôi động. Người chơi có thể tùy chỉnh xe với hàng ngàn vật phẩm trang trí, từ bánh xe, sơn xe, đến hiệu ứng boost. Với mô hình miễn phí, đồ họa bắt mắt, và lối chơi gây nghiện, Rocket League là lựa chọn hoàn hảo cho những ai yêu thích sự cạnh tranh và sáng tạo.",
        "age-limit": "3+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_1_tpsei1.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_2_qkqd67.webp",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_4_yfgbzn.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_5_swf1cv.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_3_jzgije.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023565/rl_1_tpsei1.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core 2 Duo E4600 / AMD Athlon 64 X2 4800+.",
        "ram": "2 GB.",
        "gpu": "NVIDIA GeForce 8800 GT / AMD Radeon HD 3850.",
        "disk": "7 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2300 / AMD FX-6300.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 670 / AMD Radeon HD 7950.",
        "disk": "7 GB."
      },
      "price": 0
    },
    {
      "id": "24",
      "name": "Far Cry 6",
      "tags": [
        "action",
        "shooter",
        "open-world"
      ],
      "details": {
        "publisher": "Ubisoft",
        "published_date": {
          "$date": "2021-10-07T00:00:00Z"
        },
        "describe": "Far Cry 6 là một game bắn súng thế giới mở từ Ubisoft, lấy bối cảnh đảo quốc giả tưởng Yara, một thiên đường nhiệt đới bị kìm kẹp bởi chế độ độc tài của Antón Castillo, do diễn viên Giancarlo Esposito thủ vai. Người chơi hóa thân thành Dani Rojas (có thể chọn giới tính), một chiến binh du kích, dẫn dắt cuộc cách mạng lật đổ Castillo và giải phóng Yara. Cốt truyện khám phá các chủ đề về tự do, áp bức, và hy sinh, với các nhân vật phụ đầy màu sắc như Juan Cortez, một cựu điệp viên, hay Clara García, lãnh đạo lực lượng nổi dậy. Lối chơi của Far Cry 6 mang đến tự do khám phá một thế giới rộng lớn, từ rừng rậm, bãi biển, đến thủ đô Esperanza, với các hoạt động như chiếm căn cứ, phá hoại, hoặc săn bắn. Người chơi có thể sử dụng kho vũ khí đa dạng, từ súng tự chế (Resolver) như súng bắn đĩa CD, đến các phương tiện như xe tăng, trực thăng, hoặc ngựa. Hệ thống Amigos cho phép tuyển mộ đồng minh động vật như cá sấu Guapo hay chó Dachshund Chorizo. Game cũng có chế độ co-op, cho phép chơi cùng bạn bè. Với đồ họa rực rỡ, âm nhạc Latin sôi động, và cốt truyện hấp dẫn, Far Cry 6 là một cuộc phiêu lưu hành động đầy kịch tính.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/fc_3_iehgvi.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/fc_5_ghz4zu.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/fc_1_efj9bx.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/fc_2_q95a6w.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/fc_4_kl4oow.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/fc_1_efj9bx.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-4460 / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 960 / AMD Radeon RX 460.",
        "disk": "60 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-7700 / AMD Ryzen 5 3600X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA RTX 2070 Super / AMD Radeon RX 5700 XT.",
        "disk": "60 GB."
      },
      "price": 599000
    },
    {
      "id": "25",
      "name": "Cities: Skylines",
      "tags": [
        "simulation",
        "city-building",
        "strategy"
      ],
      "details": {
        "publisher": "Paradox Interactive",
        "published_date": {
          "$date": "2015-03-10T00:00:00Z"
        },
        "describe": "Cities: Skylines là một game mô phỏng xây dựng thành phố từ Colossal Order, mang đến trải nghiệm quản lý đô thị chi tiết và sáng tạo. Người chơi bắt đầu với một mảnh đất trống và xây dựng một thành phố từ con số không, quản lý mọi khía cạnh từ quy hoạch đường xá, giao thông, đến kinh tế, giáo dục, và dịch vụ công như y tế, cứu hỏa. Lối chơi yêu cầu người chơi cân bằng ngân sách, đáp ứng nhu cầu của dân chúng, và giải quyết các vấn đề như tắc đường, ô nhiễm, hoặc thiếu điện. Thế giới game cho phép tạo ra các thành phố đa dạng, từ đô thị hiện đại, khu công nghiệp, đến các thị trấn ven biển hoặc vùng núi. Hệ thống giao thông phức tạp, với đường bộ, đường sắt, tàu điện ngầm, và cảng, là điểm nhấn của game, yêu cầu người chơi thiết kế mạng lưới hiệu quả. Các bản mở rộng như After Dark (đêm và du lịch), Snowfall (thời tiết tuyết), và Industries (quản lý công nghiệp) bổ sung thêm chiều sâu và tính năng mới. Game cũng hỗ trợ modding, cho phép cộng đồng tạo ra hàng ngàn nội dung tùy chỉnh, từ tòa nhà, bản đồ, đến phương tiện. Với đồ họa đẹp mắt, âm nhạc thư giãn, và lối chơi sâu sắc, Cities: Skylines là thiên đường cho những ai đam mê xây dựng và quản lý đô thị.",
        "age-limit": "3+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023557/cs_3_eud372.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/cs_4_d6ivhh.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/cs_1_hnt8sq.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/cs_5_abh4ch.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/cs_5_abh4ch.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core 2 Duo E7600 / AMD Athlon 64 X2 6400+.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce GTX 260 / AMD Radeon HD 5670.",
        "disk": "4 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-3470 / AMD FX-6300.",
        "ram": "6 GB.",
        "gpu": "NVIDIA GTX 660 / AMD Radeon HD 7870.",
        "disk": "4 GB."
      },
      "price": 199000
    },
    {
      "id": "26",
      "name": "Hades",
      "tags": [
        "roguelike",
        "action",
        "indie"
      ],
      "details": {
        "publisher": "Supergiant Games",
        "published_date": {
          "$date": "2020-09-17T00:00:00Z"
        },
        "describe": "Hades là một game hành động roguelike từ Supergiant Games, lấy cảm hứng từ thần thoại Hy Lạp và được kể qua góc nhìn hiện đại, đầy phong cách. Người chơi vào vai Zagreus, con trai của thần Hades, quyết tâm thoát khỏi địa ngục để tìm kiếm mẹ mình trên đỉnh Olympus. Mỗi lần chơi, bạn chiến đấu qua các tầng của Underworld, từ Tartarus, Asphodel, đến Elysium, đối mặt với quái vật, linh hồn, và các boss như Megera hay Theseus. Lối chơi kết hợp chiến đấu nhanh với các vũ khí như kiếm, cung, khiên, hoặc găng tay, mỗi loại có phong cách riêng. Zagreus nhận được các Boon (phước lành) từ các vị thần như Zeus, Athena, hoặc Poseidon, mang đến sức mạnh và hiệu ứng độc đáo, khiến mỗi lần chơi đều khác biệt. Nếu chết, bạn quay về House of Hades, nơi có thể nâng cấp kỹ năng bằng tài nguyên thu thập được. Cốt truyện được kể qua các đoạn hội thoại với các nhân vật như Hades, Achilles, hay Nyx, hé lộ dần mối quan hệ gia đình và bí mật của Underworld. Với đồ họa vẽ tay tuyệt đẹp, lồng tiếng xuất sắc, và âm nhạc cuốn hút, Hades không chỉ là một game hành động mà còn là một câu chuyện giàu cảm xúc, thu hút cả người mới và fan của thể loại roguelike.",
        "age-limit": "13+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023560/h_2_qk54bg.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023560/h_5_fwbih5.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023559/h_3_h8ng3k.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023559/h_4_nsyg8x.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023558/h_1_farndj.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023560/h_2_qk54bg.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Dual Core 2.4GHz / AMD equivalent.",
        "ram": "4 GB.",
        "gpu": "1GB VRAM, DirectX 10+ support.",
        "disk": "15 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i3-2130 / AMD equivalent.",
        "ram": "8 GB.",
        "gpu": "2GB VRAM, DirectX 11+ support.",
        "disk": "15 GB."
      },
      "price": 179000
    },
    {
      "id": "27",
      "name": "Total War: Warhammer III",
      "tags": [
        "strategy",
        "turn-based",
        "fantasy"
      ],
      "details": {
        "publisher": "Sega",
        "published_date": {
          "$date": "2022-02-17T00:00:00Z"
        },
        "describe": "Total War: Warhammer III là phần cuối của bộ ba game chiến thuật từ Creative Assembly, lấy bối cảnh thế giới giả tưởng Warhammer đầy ma thuật và chiến tranh. Người chơi chọn một trong các phe phái như Kislev băng giá, Cathay huyền bí, hoặc các Chaos Gods như Khorne, Nurgle, Tzeentch, và Slaanesh, mỗi phe có lối chơi và đơn vị độc đáo. Lối chơi kết hợp quản lý đế chế theo lượt trên bản đồ chiến dịch, nơi bạn xây dựng thành phố, chiêu mộ quân đội, và thực hiện ngoại giao, với chiến đấu thời gian thực trên các chiến trường hoành tráng. Các trận đánh cho phép điều khiển hàng ngàn đơn vị, từ hiệp sĩ, rồng, đến quái vật khổng lồ, với chiến thuật phụ thuộc vào địa hình, phép thuật, và đội hình. Cốt truyện chính xoay quanh việc ngăn chặn hoặc giải phóng Ursun, vị thần gấu của Kislev, bị giam cầm trong Realm of Chaos. Ngoài chiến dịch chính, game có chế độ Immortal Empires, hợp nhất bản đồ và phe phái từ cả ba phần, tạo nên trải nghiệm chiến lược khổng lồ. Các bản mở rộng bổ sung thêm phe phái và nội dung mới. Với đồ họa chi tiết, âm nhạc sử thi, và chiều sâu chiến thuật, Total War: Warhammer III là thiên đường cho fan của chiến lược và thế giới Warhammer.",
        "age-limit": "16+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023569/tww_3_myxp37.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023569/tww_4_alo0az.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023569/tww_1_qwfe4m.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023569/tww_5_ukpij2.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023568/tw_2_pbnozj.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023568/tw_2_pbnozj.jpg",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core i3-2100 / AMD FX-4300.",
        "ram": "6 GB.",
        "gpu": "NVIDIA GTX 650 Ti / AMD Radeon HD 7770.",
        "disk": "120 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-6600 / AMD Ryzen 5 2600X.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1660 Ti / AMD RX 5600 XT.",
        "disk": "120 GB."
      },
      "price": 599000
    },
    {
      "id": "28",
      "name": "Death Stranding",
      "tags": [
        "action",
        "adventure",
        "exploration"
      ],
      "details": {
        "publisher": "505 Games",
        "published_date": {
          "$date": "2020-07-14T00:00:00Z"
        },
        "describe": "Death Stranding là một game phiêu lưu hành động độc đáo từ Hideo Kojima, lấy bối cảnh một thế giới hậu tận thế nơi nước Mỹ bị chia cắt bởi hiện tượng Death Stranding, khiến các linh hồn BT (Beached Things) và mưa Timefall (gây lão hóa nhanh) xuất hiện. Người chơi vào vai Sam Porter Bridges, một người giao hàng, với nhiệm vụ kết nối các thành phố và trạm trú ẩn để tái thiết mạng lưới UCA (United Cities of America). Lối chơi tập trung vào việc vận chuyển hàng hóa qua địa hình hiểm trở, từ núi đá, sông băng, đến sa mạc, trong khi quản lý cân bằng, trang bị, và sức bền của Sam. Người chơi phải tránh hoặc đối phó với BT bằng cách sử dụng các công cụ như cảm biến, súng, hoặc thậm chí là máu của Sam. Ngoài ra, game có các yếu tố chiến đấu với cướp MULE và các trận chiến boss siêu thực. Một điểm nhấn là hệ thống chơi bất đồng bộ, nơi người chơi có thể xây cầu, đường, hoặc để lại vật phẩm giúp đỡ người chơi khác mà không gặp trực tiếp. Cốt truyện phức tạp, với các nhân vật như Fragile, Higgs, và Amelie, khám phá các chủ đề về sự kết nối, cái chết, và hy vọng. Với đồ họa ngoạn mục, âm nhạc ám ảnh, và lối chơi sáng tạo, Death Stranding là một trải nghiệm không giống bất kỳ game nào khác.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/ds_3_zaqghy.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/ds_4_hueizl.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/ds_5_evvgvh.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/ds_1_kc5c0k.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/ds_2_rxmlqq.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/ds_3_zaqghy.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-3470 / AMD Ryzen 3 1200.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1050 / AMD Radeon RX 560.",
        "disk": "80 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i7-3770 / AMD Ryzen 5 1600.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 1060 6GB / AMD Radeon RX 590.",
        "disk": "80 GB."
      },
      "price": 499000
    },
    {
      "id": "29",
      "name": "Celeste",
      "tags": [
        "platformer",
        "indie",
        "adventure"
      ],
      "details": {
        "publisher": "Matt Makes Games",
        "published_date": {
          "$date": "2018-01-25T00:00:00Z"
        },
        "describe": "Celeste là một game platformer 2D độc lập từ Matt Makes Games, được yêu thích nhờ lối chơi chính xác và câu chuyện cảm động. Người chơi điều khiển Madeline, một cô gái trẻ, trong hành trình leo lên đỉnh núi Celeste để đối mặt với những nỗi sợ hãi và bất an trong tâm hồn. Lấy bối cảnh một ngọn núi huyền bí với các khu vực như thị trấn bỏ hoang, đền thờ cổ, hay những vách đá gió hú, Celeste kết hợp lối chơi platformer thử thách với một câu chuyện sâu sắc về sức khỏe tinh thần và sự tự khám phá. Lối chơi yêu cầu người chơi thực hiện các pha nhảy, leo trèo, và dash (lao nhanh) với độ chính xác cao để vượt qua hàng trăm màn chơi đầy chướng ngại vật như gai nhọn, gió mạnh, hoặc các cơ chế độc đáo như bong bóng dịch chuyển. Game nổi tiếng với độ khó nhưng luôn công bằng, khuyến khích người chơi thử lại và cải thiện kỹ năng. Madeline nhận được sự hỗ trợ từ các nhân vật như Theo, Granny, và thậm chí là một phiên bản “Badeline” đại diện cho mặt tối của cô. Các màn chơi bổ sung (B-Sides, C-Sides) và chương Farewell mang đến thử thách cao cấp cho người chơi kỳ cựu. Celeste cũng có chế độ Assist Mode, giúp người chơi điều chỉnh độ khó để tập trung vào cốt truyện. Với đồ họa pixel art tuyệt đẹp, âm nhạc chiptune cảm xúc, và thông điệp truyền cảm hứng, Celeste là một viên ngọc indie, chạm đến trái tim của cả những người yêu thích platformer lẫn những ai tìm kiếm một câu chuyện ý nghĩa.",
        "age-limit": "10+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023556/c_5_iv0qef.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/c_2_wntvne.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/c_4_mftkdv.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023555/c_3_tss5c0.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/c_1_zjzpbu.png"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/c_1_zjzpbu.png",
      "minimum_configuration": {
        "os": "Windows 7 64 Bit.",
        "cpu": "Intel Core i3-2100 / AMD equivalent.",
        "ram": "2 GB.",
        "gpu": "Intel HD Graphics 4000.",
        "disk": "1.2 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2300 / AMD equivalent.",
        "ram": "4 GB.",
        "gpu": "NVIDIA GeForce 8800 GT / AMD Radeon HD 5670.",
        "disk": "1.2 GB."
      },
      "price": 129000
    },
    {
      "id": "30",
      "name": "Diablo IV",
      "tags": [
        "action",
        "role-playing",
        "hack-and-slash"
      ],
      "details": {
        "publisher": "Blizzard Entertainment",
        "published_date": {
          "$date": "2023-06-06T00:00:00Z"
        },
        "describe": "Diablo IV là phần mới nhất trong series game nhập vai hành động huyền thoại từ Blizzard Entertainment, đưa người chơi trở lại thế giới Sanctuary u ám, nơi cuộc chiến giữa thiên thần và ác quỷ không bao giờ kết thúc. Lấy bối cảnh nhiều năm sau Diablo III, game kể về sự trở lại của Lilith, Mẹ của Quỷ, người âm mưu thống trị Sanctuary và thao túng loài người. Người chơi có thể chọn một trong năm lớp nhân vật – Barbarian, Druid, Necromancer, Rogue, hoặc Sorcerer – mỗi lớp có phong cách chiến đấu và kỹ năng độc đáo, từ sức mạnh cận chiến của Barbarian đến phép thuật nguyên tố của Sorcerer. Lối chơi của Diablo IV tập trung vào chiến đấu hack-and-slash nhịp độ nhanh, với các màn tàn sát quái vật trên bản đồ thế giới mở rộng lớn, bao gồm các vùng đất như Scosglen xanh tươi, Dry Steppes khô cằn, và Hawezar đầy đầm lầy. Game cung cấp hàng trăm nhiệm vụ phụ, dungeon ngẫu nhiên, và các sự kiện thế giới như Helltides, nơi người chơi đối mặt với làn sóng kẻ thù để thu thập chiến lợi phẩm. Hệ thống tùy chỉnh nhân vật sâu sắc cho phép nâng cấp kỹ năng, chọn trang bị huyền thoại, và xây dựng lối chơi riêng. Diablo IV cũng có yếu tố đa người chơi, từ hợp tác hoàn thành nhiệm vụ đến PvP trong các khu vực đặc biệt. Với đồ họa tối tăm, âm nhạc hùng tráng, và cốt truyện đen tối, Diablo IV mang đến trải nghiệm nhập vai mãnh liệt cho fan của dòng game hack-and-slash.",
        "age-limit": "18+"
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023554/d_5_eeh58r.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023553/d_4_q1rzbe.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023552/d_3_wqy3zq.png",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/d_2_f0gv77.jpg",
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/d_1_gzd0tb.jpg"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746023551/d_1_gzd0tb.jpg",
      "minimum_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-2500K / AMD FX-8100.",
        "ram": "8 GB.",
        "gpu": "NVIDIA GTX 660 / AMD Radeon R9 280.",
        "disk": "90 GB."
      },
      "recommended_configuration": {
        "os": "Windows 10 64 Bit.",
        "cpu": "Intel Core i5-4670K / AMD Ryzen 3 1300X.",
        "ram": "16 GB.",
        "gpu": "NVIDIA GTX 970 / AMD Radeon RX 470.",
        "disk": "90 GB."
      },
      "price": 799000
    },
    {
      "id": "31",
      "name": "new_test",
      "price": 150000,
      "tags": [
        "action",
        "fighting"
      ],
      "details": {
        "publisher": "test",
        "describe": "",
        "age-limit": ""
      },
      "images": [
        "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746561931/rdr_5_ttprwf.webp"
      ],
      "thumbnail_image": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746561931/rdr_5_ttprwf.webp",
      "minimum_configuration": {
        "os": "Windows 10",
        "cpu": "Intel i5",
        "ram": "8GB",
        "gpu": "NVIDIA GTX 970",
        "disk": "50GB"
      },
      "recommended_configuration": {
        "os": "Windows 11",
        "cpu": "Intel i7",
        "ram": "16GB",
        "gpu": "NVIDIA RTX 3060",
        "disk": "100GB"
      }
    }
  ],
  "comments": [
    {
      "user_id": 29,
      "game_id": 17,
      "rating": 2,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "4530",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 2,
      "game_id": 24,
      "rating": 3,
      "comment": "Rất đáng chơi!",
      "id": "2124",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 7,
      "game_id": 6,
      "rating": 2,
      "comment": "Không tệ, nhưng cần update",
      "id": "1b66",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 10,
      "game_id": 13,
      "rating": 2,
      "comment": "Game rất cuốn.",
      "id": "6551",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 28,
      "rating": 2,
      "comment": "Cốt truyện xuất sắc.",
      "id": "9cc1",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 1,
      "game_id": 19,
      "rating": 3,
      "comment": "Cốt truyện xuất sắc.",
      "id": "f624",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 12,
      "game_id": 30,
      "rating": 4,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "2b2f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 27,
      "game_id": 28,
      "rating": 2,
      "comment": "Game quá đỉnh!",
      "id": "946f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 2,
      "game_id": 22,
      "rating": 4,
      "comment": "Game quá đỉnh!",
      "id": "0deb",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 10,
      "game_id": 19,
      "rating": 1,
      "comment": "Game quá đỉnh!",
      "id": "d1d1",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 28,
      "game_id": 30,
      "rating": 4,
      "comment": "Game quá đỉnh!",
      "id": "e10a",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 10,
      "game_id": 29,
      "rating": 1,
      "comment": "Game rất cuốn.",
      "id": "6d89",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 15,
      "game_id": 3,
      "rating": 1,
      "comment": "Game xịn vãi ò",
      "id": "1153",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 29,
      "game_id": 30,
      "rating": 3,
      "comment": "Không tệ, nhưng cần update",
      "id": "028e",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 16,
      "game_id": 9,
      "rating": 1,
      "comment": "Thật sự gây nghiện.",
      "id": "a3fb",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 11,
      "rating": 5,
      "comment": "Không tệ, nhưng cần update",
      "id": "c1cd",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 14,
      "game_id": 25,
      "rating": 1,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "3f64",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 6,
      "rating": 5,
      "comment": "Cốt truyện xuất sắc.",
      "id": "a91c",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 8,
      "game_id": 16,
      "rating": 4,
      "comment": "Không tệ, nhưng cần update",
      "id": "3d04",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 20,
      "rating": 5,
      "comment": "Game xịn vãi ò",
      "id": "2683",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 15,
      "rating": 2,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "ec7a",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 1,
      "game_id": 24,
      "rating": 3,
      "comment": "Không tệ, nhưng cần update",
      "id": "9a28",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 3,
      "rating": 5,
      "comment": "Cốt truyện xuất sắc.",
      "id": "ff33",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 19,
      "rating": 5,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "384f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 25,
      "game_id": 1,
      "rating": 1,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "6e05",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 5,
      "game_id": 10,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "542c",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 5,
      "game_id": 17,
      "rating": 5,
      "comment": "Game xịn vãi ò",
      "id": "7d16",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 24,
      "game_id": 3,
      "rating": 3,
      "comment": "Game xịn vãi ò",
      "id": "8637",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 15,
      "game_id": 29,
      "rating": 3,
      "comment": "Game quá đỉnh!",
      "id": "c86d",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 7,
      "game_id": 21,
      "rating": 4,
      "comment": "Cốt truyện xuất sắc.",
      "id": "b177",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 18,
      "game_id": 9,
      "rating": 5,
      "comment": "Game quá đỉnh!",
      "id": "ac44",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 27,
      "game_id": 6,
      "rating": 2,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "074f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 21,
      "rating": 1,
      "comment": "Không tệ, nhưng cần update",
      "id": "8302",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 8,
      "game_id": 17,
      "rating": 4,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "91f4",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 18,
      "game_id": 13,
      "rating": 3,
      "comment": "Game xịn vãi ò",
      "id": "ccd0",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 3,
      "game_id": 29,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "ca8c",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 10,
      "game_id": 15,
      "rating": 5,
      "comment": "Thật sự gây nghiện.",
      "id": "8152",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 6,
      "game_id": 13,
      "rating": 3,
      "comment": "Game xịn vãi ò",
      "id": "ed0f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 15,
      "game_id": 9,
      "rating": 4,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "fc34",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 4,
      "game_id": 10,
      "rating": 5,
      "comment": "Rất đáng chơi!",
      "id": "1545",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 2,
      "game_id": 9,
      "rating": 2,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "73fc",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 28,
      "game_id": 26,
      "rating": 2,
      "comment": "Thật sự gây nghiện.",
      "id": "940f",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 18,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "8735"
    },
    {
      "user_id": 24,
      "game_id": 18,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "f589",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 9,
      "game_id": 26,
      "rating": 3,
      "comment": "Cốt truyện xuất sắc.",
      "id": "d27c",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 14,
      "game_id": 6,
      "rating": 4,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "3e6a",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 18,
      "rating": 3,
      "comment": "Thật sự gây nghiện.",
      "id": "0835",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 12,
      "game_id": 12,
      "rating": 1,
      "comment": "Game xịn vãi ò",
      "id": "7f75",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 11,
      "rating": 1,
      "comment": "Game rất cuốn.",
      "id": "62a0",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 24,
      "rating": 1,
      "comment": "Thật sự gây nghiện.",
      "id": "00c3",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 10,
      "rating": 4,
      "comment": "Rất đáng chơi!",
      "id": "d79b",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 26,
      "game_id": 11,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "9d98",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 18,
      "game_id": 14,
      "rating": 2,
      "comment": "Rất đáng chơi!",
      "id": "cc30",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 16,
      "game_id": 6,
      "rating": 3,
      "comment": "Game quá đỉnh!",
      "id": "f491",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 23,
      "rating": 5,
      "comment": "Cốt truyện xuất sắc.",
      "id": "fbd7",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 28,
      "rating": 5,
      "comment": "Thật sự gây nghiện.",
      "id": "5227",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 18,
      "game_id": 17,
      "rating": 1,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "7ec7",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 16,
      "game_id": 29,
      "rating": 2,
      "comment": "Game xịn vãi ò",
      "id": "8734",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 4,
      "game_id": 27,
      "rating": 1,
      "comment": "Cốt truyện xuất sắc.",
      "id": "5319",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 28,
      "game_id": 22,
      "rating": 3,
      "comment": "Cốt truyện xuất sắc.",
      "id": "20e3",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 15,
      "game_id": 25,
      "rating": 4,
      "comment": "Cốt truyện xuất sắc.",
      "id": "1cc8",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 9,
      "game_id": 10,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "f136",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 23,
      "game_id": 25,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "6b1b",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 11,
      "game_id": 13,
      "rating": 4,
      "comment": "Game quá đỉnh!",
      "id": "1231",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 18,
      "game_id": 3,
      "rating": 2,
      "comment": "Cốt truyện xuất sắc.",
      "id": "6920",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 5,
      "rating": 2,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "f6a0",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 4,
      "game_id": 16,
      "rating": 1,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "85f1",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 15,
      "game_id": 21,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "7c81",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 17,
      "rating": 3,
      "comment": "Rất đáng chơi!",
      "id": "d467",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 9,
      "game_id": 21,
      "rating": 3,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "939c",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 11,
      "game_id": 9,
      "rating": 2,
      "comment": "Game quá đỉnh!",
      "id": "5f12",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 15,
      "rating": 4,
      "comment": "Rất đáng chơi!",
      "id": "00bb",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 1,
      "rating": 5,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "3546",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 22,
      "game_id": 27,
      "rating": 1,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "9615",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 29,
      "game_id": 24,
      "rating": 1,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "2f02",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 24,
      "game_id": 3,
      "rating": 3,
      "comment": "Không tệ, nhưng cần update",
      "id": "b293",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 8,
      "game_id": 16,
      "rating": 2,
      "comment": "Không tệ, nhưng cần update",
      "id": "43eb",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 3,
      "game_id": 28,
      "rating": 3,
      "comment": "Không tệ, nhưng cần update",
      "id": "1504",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 2,
      "game_id": 7,
      "rating": 4,
      "comment": "Game quá đỉnh!",
      "id": "86bd",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 13,
      "game_id": 4,
      "rating": 5,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "65b6",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 17,
      "game_id": 7,
      "rating": 5,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "9767",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 14,
      "game_id": 22,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "08fe",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 12,
      "rating": 4,
      "comment": "Thật sự gây nghiện.",
      "id": "ee6b",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 26,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "f88b",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 24,
      "game_id": 13,
      "rating": 5,
      "comment": "Rất đáng chơi!",
      "id": "8246",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 30,
      "game_id": 19,
      "rating": 2,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "12fe",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 3,
      "rating": 3,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "40b3",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 20,
      "game_id": 20,
      "rating": 4,
      "comment": "Rất đáng chơi!",
      "id": "2ed7",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 30,
      "game_id": 25,
      "rating": 3,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "0b5e",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 8,
      "rating": 1,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "e6ba",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 21,
      "game_id": 22,
      "rating": 2,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "4fde",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 5,
      "game_id": 16,
      "rating": 5,
      "comment": "Cốt truyện xuất sắc.",
      "id": "7057",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 24,
      "game_id": 15,
      "rating": 4,
      "comment": "Chơi vui, đồ họa đẹp",
      "id": "1701",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 7,
      "game_id": 18,
      "rating": 3,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "a372",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 26,
      "game_id": 21,
      "rating": 2,
      "comment": "Tạm ổn, nên cải thiện thêm.",
      "id": "3152",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 19,
      "game_id": 5,
      "rating": 2,
      "comment": "Cốt truyện xuất sắc.",
      "id": "4e5a",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 14,
      "game_id": 30,
      "rating": 4,
      "comment": "Không hay lắm, mong đợi nhiều hơn.",
      "id": "afca",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 5,
      "game_id": 7,
      "rating": 2,
      "comment": "Không tệ, nhưng cần update",
      "id": "d5cc",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 29,
      "game_id": 10,
      "rating": 3,
      "comment": "Cốt truyện xuất sắc.",
      "id": "69d9",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    },
    {
      "user_id": 6,
      "game_id": 17,
      "rating": 2,
      "comment": "Game quá đỉnh!",
      "id": "339a",
      "commented_date": {
        "$date": "2025-05-1T00:00:00Z"
      }
    }
  ],
  "users": [
    {
      "id": "1",
      "f_name": "Le",
      "l_name": "Ngoc Hao",
      "dob": {
        "$date": "2004-10-27T00:00:00Z"
      },
      "username": "lehao",
      "password": "Lhexia001$",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "2",
      "f_name": "Do",
      "l_name": "Chi Dung",
      "username": "do2",
      "dob": {
        "$date": "2004-04-28T00:00:00.000Z"
      },
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "status": "active"
    },
    {
      "id": "3",
      "f_name": "Phan",
      "l_name": "Yen Quang",
      "dob": {
        "$date": "2001-09-07T00:00:00Z"
      },
      "username": "phan3",
      "password": "mz-Z-Zn74=2q8uVx2gUyr!x",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "deleted",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "4",
      "f_name": "Vu",
      "l_name": "Linh Hieu",
      "dob": {
        "$date": "1995-05-30T00:00:00Z"
      },
      "username": "vu4",
      "password": "BsAsyf57@XbVP+vWmtDzkKPf^9",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "5",
      "f_name": "Hoang",
      "l_name": "Nam Binh",
      "dob": {
        "$date": "1998-07-14T00:00:00Z"
      },
      "username": "hoang5",
      "password": "gV+2ZF#RImVMgf7Ix0M#nfiNbdc0",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "6",
      "f_name": "Nguyen",
      "l_name": "Linh Binh",
      "dob": {
        "$date": "2001-08-21T00:00:00Z"
      },
      "username": "nguyen6",
      "password": "yF^uWV4+df",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "7",
      "f_name": "Dang",
      "l_name": "Vy Chi",
      "dob": {
        "$date": "2007-05-04T00:00:00Z"
      },
      "username": "dang7",
      "password": "P)@FMdDK7K1-OqCoL+rnZ9na1$7",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "8",
      "f_name": "Le",
      "l_name": "Nam Son",
      "dob": {
        "$date": "1997-06-17T00:00:00Z"
      },
      "username": "le8",
      "password": "&@AT1g)U(",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "9",
      "f_name": "Le",
      "l_name": "Binh Chi",
      "dob": {
        "$date": "2006-02-04T00:00:00Z"
      },
      "username": "le9",
      "password": "EZB=!&YLw#fb8Vhu(aFC1R-kSCX",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "10",
      "f_name": "Hoang",
      "l_name": "Dung Yen",
      "dob": {
        "$date": "2002-10-23T00:00:00Z"
      },
      "username": "hoang10",
      "password": "cDhItQh(!sy2-S",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "11",
      "f_name": "Do",
      "l_name": "Binh Khoa",
      "dob": {
        "$date": "1996-12-10T00:00:00Z"
      },
      "username": "do11",
      "password": "H5C)56B_Pkgeg5Lc+krWVRe",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "12",
      "f_name": "Phan",
      "l_name": "Vy An",
      "dob": {
        "$date": "1996-02-18T00:00:00Z"
      },
      "username": "phan12",
      "password": "5i8zz^^T=yXcffUyki",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "13",
      "f_name": "Do",
      "l_name": "Chi An",
      "dob": {
        "$date": "2001-04-09T00:00:00Z"
      },
      "username": "do13",
      "password": "51Pdp+NrcrBk$bT",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "14",
      "f_name": "Nguyen",
      "l_name": "Khoa Vy",
      "dob": {
        "$date": "1998-05-08T00:00:00Z"
      },
      "username": "nguyen14",
      "password": "qzv7M7WS$PmtRRUcS=myX5m3M",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "15",
      "f_name": "Nguyen",
      "l_name": "Khoa Dung",
      "dob": {
        "$date": "2004-04-19T00:00:00Z"
      },
      "username": "nguyen15",
      "password": "G0b-(&fm0458zxmS0^-tar",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "16",
      "f_name": "Do",
      "l_name": "Linh Quang",
      "dob": {
        "$date": "1995-06-22T00:00:00Z"
      },
      "username": "do16",
      "password": "APK3t!8GA^hy!im2Ie1Kltm%C(6L)w",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "17",
      "f_name": "Pham",
      "l_name": "Linh Khoa",
      "dob": {
        "$date": "2005-09-08T00:00:00Z"
      },
      "username": "pham17",
      "password": "ZJ!Ce*lhRy@MyK=a&eB6",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "18",
      "f_name": "Do",
      "l_name": "Hieu Dung",
      "dob": {
        "$date": "2004-08-14T00:00:00Z"
      },
      "username": "do18",
      "password": "!n_d@KRjPa(n+fkJ0l0m(*",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "19",
      "f_name": "Tran",
      "l_name": "Chi Hieu",
      "dob": {
        "$date": "2000-11-16T00:00:00Z"
      },
      "username": "tran19",
      "password": "-0NUPN&Kho&3Hgys1",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "20",
      "f_name": "Nguyen",
      "l_name": "Khoa Trang",
      "dob": {
        "$date": "1998-02-18T00:00:00Z"
      },
      "username": "nguyen20",
      "password": "lN2pHToS$KjvwfIHq4M0+x",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "21",
      "f_name": "Tran",
      "l_name": "Minh An",
      "dob": {
        "$date": "2002-12-03T00:00:00Z"
      },
      "username": "tran21",
      "password": "A@^et+&9vd^h#((sH5uJB2MSzQX",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "22",
      "f_name": "Bui",
      "l_name": "Minh Son",
      "dob": {
        "$date": "1997-08-20T00:00:00Z"
      },
      "username": "bui22",
      "password": "MEaaegUn5h8jI!U5ZvBT",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "23",
      "f_name": "Nguyen",
      "l_name": "Khoa Hieu",
      "dob": {
        "$date": "2007-03-15T00:00:00Z"
      },
      "username": "nguyen23",
      "password": "+Y#f*2J7+6",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "24",
      "f_name": "Nguyen",
      "l_name": "Linh Yen",
      "dob": {
        "$date": "1999-10-06T00:00:00Z"
      },
      "username": "nguyen24",
      "password": "+Ky*NonF3(Tm#$A50n-c",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "25",
      "f_name": "Le",
      "l_name": "Linh Dung",
      "dob": {
        "$date": "1998-07-04T00:00:00Z"
      },
      "username": "le25",
      "password": "%7Ej_^ZoXe%$qc2RDgp=RVatQxqZ-",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "26",
      "f_name": "Phan",
      "l_name": "Nam Nam",
      "dob": {
        "$date": "1998-10-30T00:00:00Z"
      },
      "username": "phan26",
      "password": "+XJ8i-4vzRIL-b",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "27",
      "f_name": "Nguyen",
      "l_name": "Linh Nam",
      "dob": {
        "$date": "1995-05-14T00:00:00Z"
      },
      "username": "nguyen27",
      "password": "RGH$bsJDL5U&xST4d6W4k^S",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "28",
      "f_name": "Bui",
      "l_name": "Khoa Yen",
      "dob": {
        "$date": "1996-03-20T00:00:00Z"
      },
      "username": "bui28",
      "password": "!ZD2WtbvChiCwj*HCk$4lT9W",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "29",
      "f_name": "Dang",
      "l_name": "Son Dung",
      "dob": {
        "$date": "1999-07-20T00:00:00Z"
      },
      "username": "dang29",
      "password": "EFY#w#UUh%lpkmVmXs&llDW9C",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "30",
      "f_name": "Le",
      "l_name": "Chi Vy",
      "dob": {
        "$date": "2002-04-06T00:00:00Z"
      },
      "username": "le30",
      "password": "yt-GE_gqUpfJ8khm#",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "31",
      "f_name": "Le",
      "l_name": "Dung Hieu",
      "dob": {
        "$date": "2003-04-07T00:00:00Z"
      },
      "username": "le31",
      "password": "6XmI@nuIWkaMHFm1-^Pa+Im",
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746630940/avatar_f6yerg.jpg",
      "role": "user",
      "status": "active",
      "created_at": "2024-05-01T12:00:00Z",
      "last_login": "2025-05-06T17:23:00Z"
    },
    {
      "id": "32",
      "f_name": "test",
      "l_name": "demo",
      "username": "demo",
      "dob": {
        "$date": "2025-05-04T00:00:00.000Z"
      },
      "avatar": "https://res.cloudinary.com/dqnj8bsgu/image/upload/v1746633530/avatar_whosjl.jpg",
      "status": "deleted"
    },
    {
      "id": "2efa",
      "username": "thuan",
      "email": "123@gmai.com",
      "password": "123456"
    }
  ],
  "wishlist": [
    {
      "id": "1",
      "user_id": 1,
      "fav_game_id": [
        1,
        2,
        3
      ]
    }
  ],
  "cart": [
    {
      "id": "1",
      "user_id": 1,
      "cart_items": [
        {
          "id": 1
        },
        {
          "id": 2
        },
        {
          "id": 3
        }
      ]
    }
  ],
  "monthly_statistic": [
    {
      "id": "1",
      "time": "4-2025",
      "revenue": 1500000000,
      "num_of_user": 10,
      "num_of_interaction": 300,
      "avg_cus_spend": 139000
    }
  ],
  "message_to_admin": [
    {
      "id": "1",
      "user_id": 1,
      "messages": [
        {
          "sent_time": {
            "$date": "2025-03-03T00:00:00Z"
          },
          "type": "client_send",
          "content": "Web tệ quá, cần nâng cấp thêm !!"
        },
        {
          "sent_time": {
            "$date": "2025-03-03T01:00:00Z"
          },
          "type": "admin_reply",
          "content": "Chúng tôi chân thành cảm ơn góp ý của bạn, chúng tôi sẽ cố gắng hoàn thiện thêm trong tương lai gần ạ !!"
        }
      ]
    }
  ],
  "purchases": [
    {
      "id": "1",
      "user_id": 1,
      "games_purchased": [
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 1,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 2,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 3,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 4,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 5,
          "price": 259000
        }
      ]
    },
    {
      "id": "2",
      "user_id": 2,
      "games_purchased": [
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 10,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 17,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 22,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 30,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 8,
          "price": 259000
        }
      ]
    },
    {
      "id": "3",
      "user_id": 3,
      "games_purchased": [
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 30,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-05-14T00:00:00Z"
          },
          "game_id": 6,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 11,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 17,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 25,
          "price": 259000
        }
      ]
    },
    {
      "id": "4",
      "user_id": 4,
      "games_purchased": [
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 30,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-05-14T00:00:00Z"
          },
          "game_id": 6,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-05-14T00:00:00Z"
          },
          "game_id": 11,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 17,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 25,
          "price": 259000
        }
      ]
    },
    {
      "id": "5",
      "user_id": 5,
      "games_purchased": [
        {
          "purchased_at": {
            "$date": "2025-05-14T00:00:00Z"
          },
          "game_id": 30,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-05-14T00:00:00Z"
          },
          "game_id": 6,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 11,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 17,
          "price": 259000
        },
        {
          "purchased_at": {
            "$date": "2025-04-14T00:00:00Z"
          },
          "game_id": 25,
          "price": 259000
        }
      ]
    }
  ]
}